{
  "posts": [
    {
      "id": "steak-n-shake-bitcoin-fees",
      "title": "Steak 'n Shake's Cuts Payment Fees By 50% With Bitcoin",
      "excerpt": "An american burger restuarant Steak 'n Shake's has opened up on the benefits of accepting Bitcoin as a payment method and shared why they're never going back!!",
      "content": "<p>This is a featured external article. <a href=\"https://lightning.news/steak-n-shakes-cuts-payment-fees-by-50-with-bitcoin/\" target=\"_blank\">Read the full article here</a>.</p>",
      "category": "Technology",
      "date": "2025-08-20",
      "readTime": "10 min",
      "featured": true,
  "image": "images/Bit_POS.jpeg",
      "slug": "steak-n-shake-bitcoin-fees",
      "externalUrl": "https://lightning.news/steak-n-shakes-cuts-payment-fees-by-50-with-bitcoin/",
      "author": {
        "name": "James",
        "title": "Bitcoin Blogger",
        "bio": "Bitcoin payments enthusiast.",
        "avatar": "images/valet_logo_white.png",
        "social": {
          "twitter": "",
          "linkedin": "",
          "github": "",
          "url": "https://lightning.news/author/james/"
        }
      }
    },
    {
      "id": "business-bitcoin-lightning-2025",
      "title": "The $5 Trillion Problem: How Bitcoin Startups Could Finally Dethrone Visa/Mastercard with Lightning",
      "excerpt": "Visa and Mastercard, backed by banks,have built a quasi oligopoly to control global payments. But the Lightning Network now poses a huge threat of disrupting these legacy payment systems.",
      "content": "<p>This is a featured external article. <a href=\"https://techbullion.com/the-5-trillion-problem-how-bitcoin-startups-could-finally-dethrone-visa-mastercard-with-lightning/\" target=\"_blank\">Read the full article here</a>.</p>",
      "category": "Business",
      "date": "2025-10-16",
      "readTime": "7 min",
      "featured": true,
  "image": "images/business01.png",
      "slug": "bitcoin-lightning-dethrone-visa-mastercard",
      "externalUrl": "https://techbullion.com/the-5-trillion-problem-how-bitcoin-startups-could-finally-dethrone-visa-mastercard-with-lightning/",
      "author": {
  "name": "Abdul Basit",
  "title": "Tech Writer & Visionary",
        "bio": "A tech enthusiast and visionary thinker, exploring the ever-evolving landscape of innovation. With a knack for demystifying complex concepts, Basit's insightful commentary navigates readers through the dynamic world of technology, inspiring curiosity and forward thinking.",
        "avatar": "images/valet_logo_white.png",
        "social": {
          "twitter": "",
          "linkedin": "https://www.linkedin.com/in/abdul-basit-b8651366?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3B7tFx3bzzS%2FCgTHsAyXuPvA%3D%3D",
          "github": ""
        }
      }
    },
    {
      "id": "8",
      "title": "The Bitcoin's Scaling Route - Lightning Fast ⚡⚡",
      "excerpt": "We'll be exploring how the Bitcoin's Lightning Network solves the scalability issue of the main blockchain by enabling fast, low-cost, and micro-transactions through a second layer.",
      "content": "**RECAP**\n\n\nIn our previous Article, ***\"The Locker Room - A Bitcoin Wallet\"***, we explained what Bitcoin wallets are and how Bitcoin transactions are carried out from wallet to wallet in relation to the Bitcoin blockchain, where actual Bitcoins are stored. In that write-up, we referred to the Bitcoin Blockchain as the ***\"School Cafeteria\"***.\n\nIn this article, we will take a deep dive into the Lightning Network, while still sticking to our school cafeteria analogy. You may need to read the first article so you can easily follow up and understand this one and the connections.\n\nRead [here](https://stacker.news/items/1049161)\n\n\n\nBooting....\n\n\n\n**INTRODUCTION:**\n\nIt is important to reiterate that Bitcoin runs on a public ledger called the ***\"Blockchain\".*** In the first article, we illustratively referred to the Bitcoin blockchain as a school cafeteria where provisions are kept, and these provisions are assigned to various owners who can access their portion of provisions with a ***public/private key*** pair that is always stored in their lockers *(wallet)*.\n\n\nWe also highlighted that if you want to transfer the ownership of your provision(s), you'll have to sign it with your private key, publish it, and everyone using the Cafeteria *(Blockchain)* would be able to see that you have now assigned your provisions *(Bitcoin)* to someone else.\nBut we intentionally did not tell you that each time you do this, a group of ***chefs*** *(Bitcoin Miners)* must verify the transaction you published, and confirm that you own enough provisions on the Cafeteria to publish that transfer order, and that you have signed that transfer order with the correct private keys to which the provisions *(Bitcoins)* were initially assigned.\n\nTheir ultimate job is to ensure that all the provisions in the Cafeteria belong to the rightful owners and there's no fraud or cheating when sending and receiving provisions.\nThe activities of these chefs also bring about the addition of new provisions *(Bitcoins)* into the Cafeteria. The process by which this is done is called ***\"Bitcoin Mining\"***.\n\n\n\n**BITCOIN MINING IN A NUTSHELL- The Chefs**\n\n<img src=\"../../blog_img/A2_01.png\" alt=\"Bitcoin Mining in a Nutshell\" style=\"max-width: 100%; height: auto; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); margin: 1.5rem auto; display: block;\">\n\nWe will not go deep into what Bitcoin Mining entails, but we'll quickly summarize what is happening in Bitcoin Mining and highlight its importance.\n\nA group of chefs *(Bitcoin Miners)* who own and run a specialized type of ovens *(Mining Machines)* are vested with the responsibility of verifying that all the exchanges of provisions from one owner to another in the cafeteria *(Blockchain)* are valid.\n\nThey do this by checking that:\n\n*1. A sender has enough provisions that would cover the amount they want to send, plus the fees they'll pay (transaction fee).*\n\n*2. You have signed and published that transfer order (transaction) with the right private key belonging to the public key to which the provisions you want to transfer were initially assigned. (If you did not understand this line, then you need to read our first article [here](https://stacker.news/items/1049161)*\n\n*3. All other required tiny technical conditions are met.*\n\nThere are thousands or even millions of chefs who do these checks and balances *(and yes, anyone can become a chef, a.k.a. Bitcoin Miner)*. When several transfers of provisions *(Bitcoin transactions)* are published by different people on the Cafeteria, these chefs collect them one after the other and confirm that they meet the right conditions.\nFor each transaction they check and verify, they put it into a ***provision container*** *(a block)*. All the chefs use provision containers of equal size *(equal block size)*, and ***they're all in a competition to be the first to fill their containers with valid transactions, while doing some difficult cooking in the background (proof of work mathematical puzzle).***\n\nThe first chef to publish the accurate result from the difficult cooking *(math puzzle)* wins the competition, and then all the transactions they included in their provision container will generally be accepted as approved by everyone, and it is added to the history book in the cafeteria, and the marathon starts again. This marathon happens every 10 minutes. *(We'll dive deeply into Bitcoin mining in a separate article.)*\n\nIt is important to note that these chefs can choose a transaction to include in their provision box based on the amount the publisher is willing to pay in transaction fees.\n\n\nBut there's a problem....\n\n\nThe problem is that ***\"Each of those provision containers *(transaction blocks)* has a limited number of transactions that can be fitted into it at a time, and out of all the possible number of chefs doing the marathon, only one chef's provision container can be published and added to the history of the cafeteria every 10 minutes.\"*** This was intentionally designed thus for a very important reason.\n\n***The current number of transactions that can be fitted into a Bitcoin block *(chefs’ provision container)* is approximately 2500 transactions***. This suggests that if, say, 1 million people publish their transactions within a 10-minute time frame, the provision boxes *(the block)* can only hold 2500 transactions, which would then mean that only 2500 transactions get approved every 10 minutes.\n\nThis is a problem because it'd mean that just a few number of Bitcoin transactions can be approved every 10 minutes despite the number of people making transactions per time. It would also result in incredibly high transaction fees, because everyone will be fighting to have their transaction included in the next available block.\n\n***The average number of transactions processed by the Bitcoin network per day is standing at around 400k+ transactions.*** Now imagine when the whole world, or even 1/10 of the world, is using Bitcoin for daily transactions, this would  mean that:\n\n*1. Most transactions will take days, even weeks, to get approved*\n*2. Transaction fees will be too high, so much so that it'd be useless to send transactions of small amounts using Bitcoin, because the fees you will need to pay might be twice or thrice as high as the amount you want to transact.*\n\nThis problem is called ***\"The Scalability Problem\"*** in the technology world. For years, Bitcoin developers sought a way to mitigate this problem without giving up Bitcoin's security.\n\n\n**THE LIGHTNING NETWORK: - The Solution**\n\n<img src=\"../../blog_img/A2_02.png\" alt=\"The Lightning Network\" style=\"max-width: 100%; height: auto; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); margin: 1.5rem auto; display: block;\">\n\nBitcoin is money, and as money, it is meant to serve three important purposes:\n\n*- Medium of Storage*\n*- Medium of Exchange*\n*- Medium of Accounting*\n\n***As a medium of storage, it means that you can store or preserve Value in Bitcoin. With just the Bitcoin blockchain, Bitcoin can comfortably serve its function as a medium of storage.***\n\n***As a medium of exchange, Bitcoin is expected to be used for the exchange of value, even for as little as paying for a cup of coffee. But this will be very hard due to the scalability problem we described above. When so many people are hustling for the limited block size *(provision containers)*, which in turn increases the transaction fees, this would mean that you cannot pay for a cup of coffee worth 2 Cents with Bitcoin because the transaction fee you'll need to pay to get your 2-cent payment approved might be up to $3. This automatically makes it economically useless to use Bitcoin as a medium of exchange.***\n\nThis is where the **\"Bitcoin Lightning Network\"** comes into play.\n\nThe Lightning Network was designed to solve the problem of scalability associated with the main Bitcoin network. It enables the seamless on-boarding of millions *(even billions)* of users on the Bitcoin Network at once, at the same time offering consistent transaction speed, ability to send very small amounts, cheap/affordable fees, and robust privacy *(the core of Bitcoin technology)*. The Lightning network is built on top of the Bitcoin Blockchain, and it is popularly referred to as ***\"Layer 2,\"*** while the main Bitcoin Blockchain *(The cafeteria)* is referred to as ***\"Layer 1\"**.\n\nGoing back to our analogy, the Lightning network could be likened to a Canteen built right in front of the school cafeteria, where users can frequently interact and exchange provisions without having to always move their real provisions to and from the cafeteria.\n\nLet’s break this down!\n\n\n**LIGHTNING NODES -  Individual Spots in the Canteen:**\n\nEvery user can always create a spot for themselves in the canteen. This is called ***\"A Lightning Node\"***. From their spot, they can easily connect to any other person's spot. This is called creating ***\"Lightning channels.\"***\n\nFor instance, to create a connection with Mr.Brad, Mr.Adams needs to know the Spot location *(Lightning address)* of Mr.B. He'd then request a connection to Mr.B's spot, which he can accept or decline. If Mr.B accepts the connection, both of them must do something important for the connection to be established.\n\n*- Both parties must agree on the total amount of provisions that their connection can transact. This is called **\"Lightning channel capacity”**. (Oftentimes, the person initiating the connection decides the total capacity of the channel.)*\n\n*- When the above decision has been made, each party will now send their part of the agreed provision amount (Bitcoins) from the cafeteria into a shared temporary account within the canteen. (This shared account is called a \"2 of 2 multi-signature\" account. This means that the two users must agree before funds will be spent from that account.)*\n\nSo, for instance, Mr.A and Mr.B agree to create a connection where 10m provisions can be exchanged between them. Mr. A will send his portion of provisions *(maybe  6m of his provisions)* from the cafeteria into the temporary joint account in the canteen, and Mr. B will send the remaining 4m into the same joint account. The account will take a record of how much each of them contributed.\n\n\n**OUTBOUND AND INBOUND LIQUIDITY: - The power to send and receive**\n\nSince Mr.A contributed 6m provisions in that connection, he has what we call 6m Outbound Liquidity. This means that Mr.A can only send out 6m provisions from his end of the connection. On the other hand, Mr.B can send out only 4m provisions from his end of the connection.\n\nInbound Liquidity is just the opposite of outbound liquidity. Inbound Liquidity for Mr.A would be 4m provisions, while Inbound Liquidity for Mr.B would be 6m provisions. This means that Mr. A and Mr. B can, respectively, receive 4m and 6m provisions at their ends of the connection. *(These concepts are very crucial, and we will see why soon.)*\n\n\n**LIGHTNING TRANSACTIONS: - How the puzzle works**\n\n<img src=\"../../blog_img/A2_03.png\" alt=\"The Lightning Payment\" style=\"max-width: 100%; height: auto; border-radius: 8px; box-shadow: 0 2px 4px rgba(0,0,0,0.1); margin: 1.5rem auto; display: block;\">\n\nIn the above paragraph, we explained how Mr.A and B have created a connection between themselves, and thus can easily exchange value between themselves. So, the question then is, how will they be able to send provisions to others with whom they do not have direct connections?\n\nThe answer is that a user can create connections with multiple people at the same time. So Mr.A can have a connection with Mr B, who has a connection with Mr.C, who may also have a direct connection with Mr.D, etc.\n\nSo, if Mr.A wants to send provisions to Mr.D, he doesn't need to have a direct connection with Mr.D. All he needs to do is get the lightning invoice of Mr.D *(lightning invoices are what it is; an invoice used to receive payments on the lightning network)*, send the provisions to that invoice, and the provisions will be sent through his connection with Mr.B.\nFrom Mr.B, it will be hopped to Mr.C, who then finally hops it to Mr.D. This is called ***\"Multiple hopping.\"***\n\nSo anyone in the canteen can send provisions to someone else, even if they're not directly connected to them, as long as they're connected to someone within the large network. The system will automatically move the provision through the nearest connection route *(routing path)* until it gets to the desired destination. It is important to note that there is a fee paid, and it is called ***\"Routing fee\"***, but this fee is usually significantly low, mostly even negligible.\n\nReferring back to the Outbound and Inbound Liquidity we mentioned earlier, if Mr.A for instance, wants to send 7m provisions to Mr D, but he has an outbound liquidity of 6m in his connection with Mr B, he cannot send the 7m, except he receives extra 1m provisions through Mr.B, thus increasing his outbound liquidity to 7m and his inbound liquidity decreasing to 3m. This is applicable vice versa.\nSo for both parties, their inbound and outbound liquidities can change in the course of the life of their connection, depending on how they're sending and receiving through each other.\n\n\n**CLOSING A CONNECTION: - Settling Scores**\n\nThe connection between Mr.A and B can be open for as long as they want. However, if they eventually decide to close the connections, the joint account that was opened at the start will be consulted.\nFor every transaction each of them made within the period of their connection, a record is made in their joint account. So during closure, the account will be checked for balances on each side. If in the end, Mr.A now has 2m provisions left on his side, it means that Mr.B will automatically have 8m provisions left on his side. Both users will agree to a closure *(anyone can initiate closure anyway)*, and their respective provision balances *(Bitcoin balances on the multisig account)* will now be sent back to their respective accounts on the cafeteria.\n\n\n**BENEFITS OF LIGHTNING NETWORK:**\n\nWe have tried to explain the Lightning Network in a very detailed manner for anyone to understand. Now, let us highlight the significant benefits of the Lightning Network.\n\n*- SPEED: If you remember in the explanation above, only about 2500 Bitcoin transactions are confirmed on the Bitcoin Blockchain every 10 minutes due to the limited Block space, which means that a user will have to either constantly pay heavy fees for each transaction if they want their transactions to be approved faster, or wait for days, even weeks to have their transactions approved if they pay low fees or chose not to pay at all. (Because you can publish payments without including a transaction fee). But with the Lightning Network, users can pay one-time fees for opening a connection and joining the network, and thus can send and receive payments as fast as possible.*\n\n*- COST-EFFECTIVE: With the main Bitcoin Blockchain, the fees may always be high due to the demand for the limited block space every 10 minutes, and in turn, make it costly for most users to constantly send Bitcoin through the Bitcoin blockchain. But with the Lightning network, users only make one-time big transaction fees to lock their part of provisions in the joint account they created while opening a connection with someone. From here, they can send Bitcoins to anyone within the network, for a relatively insignificant fee. This makes it easy and cheap to send as many transactions as possible for way less fees or even free.*\n\n*- MICRO PAYMENTS: Due to the nature of the Bitcoin Lightning setup (where Sats are used), as well as the incredibly insignificant fees, users can make micro payments for things as little as paying for a coffee.*\n\n\n**CONCLUSION:**\n\nWe have seen how effective the Lightning Network is in scaling the Bitcoin technology. The Lightning Network greatly advances Bitcoin adoption, making it easy for people to use Bitcoin as money for day-to-day value exchange. Today, you can walk into any establishment where Bitcoin is accepted and make payments using Bitcoin, thanks to the Lightning Network.\n\nValet, our self-custodial Bitcoin wallet, also has Lightning Network technology built into it. Once you install Valet and create a wallet, you have automatically secured a spot on the Lightning Network.\nAll you need to do is find someone else you can open a connection *(channel)* to, and you can start sending and receiving Bitcoin over the Lightning network immediately.\n\nValet also has a special backup feature that saves the state of your Lightning channels on your device, such that even if you uninstall Valet, whenever you install it back, you can easily use that file to restore your wallet and all your lightning connections will be restored, this way, you do not run the risk of a forced channel closures.\n\nLearn more about how to use Lightning on Valet [here](https://valet.finance/).\n\n\nShutting down....\n\n\n",
      "category": "Education",
      "date": "2025-08-21",
      "readTime": "12 min read",
      "featured": true,
      "image": "images/A2_00.jpg",
      "slug": "the-bitcoins-scaling-route",
      "author": {
  "name": "Ugochukwu Chidire David",
  "title": "Product Growth Lead at Standard Sats",
        "bio": "Product Growth Lead at Standard Sats",
        "avatar": "images/github.jpg",
        "social": {
          "twitter": "@orion_davids",
          "linkedin": "chidire-david-ugochukwu",
          "github": "0orion"
        }
      }
    },
    {
      "id": "4",
      "title": "The School Locker - A Bitcoin Wallet 🔐",
      "excerpt": "In this article, our torchlight will shine on a foundational Bitcoin concept that is often overlooked - <strong><em>the Bitcoin Wallet.</em></strong> We will try to understand why Bitcoin wallets exist and why they're an essential part of the Bitcoin technology using simple analogies you can relate to.",
      "content": "<strong>INTRODUCTION:</strong>\n\nIn this article, our torchlight will shine on a foundational Bitcoin concept that is often overlooked - <strong><em>the Bitcoin Wallet.</em></strong> It may seem like old news, but a solid grasp of this idea is essential, especially for beginners.\nWe will try to understand why Bitcoin wallets exist and why they're an essential part of the Bitcoin technology. We will also understand the role Bitcoin wallets play in storing, sending, and receiving Bitcoins.\nThis isn't going to be just another boring technical-jargon-filled explanation - I'm going to break this down in simple language, using analogies you can relate to.\n\n\nFocus → <strong><em>Self-Custodial Bitcoin wallet type</em></strong>\n\n\nBooting....\n\n\n<strong>WHAT IS A BITCOIN WALLET?</strong>\n\nBefore we delve into what a Bitcoin wallet is, let us first understand why we need one. Bitcoin is a digital currency that runs on a public network called the <strong><em>Bitcoin Blockchain.</em></strong> Anyone can view this network - Think of the Bitcoin Blockchain like a giant public spreadsheet. Bitcoin has value because people worldwide recognize its value.\nSo, the question is: if Bitcoin is a valuable digital currency and public to everyone, how do we then determine who owns which Bitcoin and who can spend which Bitcoin? This question introduces us to the concept of a Bitcoin wallet.\n\nBut wait a sec!\n\nIs it really a <em>\"Wallet\"</em> as we know traditional wallets?\nDoes it hold an actual Bitcoin like our real-world wallets hold Dollars, Pounds, or Euros, etc?\n\nContrary to popular belief, <strong><em>Bitcoin wallets do not HOLD actual Bitcoins.</em></strong>\n\nI always think that it was due to a lack of a better term that led the Bitcoin founders and early users to refer to it as <em>\"wallet.\"</em> Perhaps it would have been more suitable to call it <em>\"Vault\"</em> because, like real-world vaults, it holds so many keys that can each lock and unlock any treasures assigned to them.\n\nImagine your school cafeteria has a massive storage of provisions. Everyone can see the provisions, but cannot necessarily take them away from the cafeteria. You only have the right/ability to transfer ownership of your portion of provisions in the cafeteria to someone else using a pair of keys to which the right of ownership of your provisions is assigned.\nThen, there are lockers in the school's locker room that contain several pairs of keys, which are used to claim or give out any portion of a provision in the cafeteria.\n\nIt is essential to know that <strong><em>Bitcoin exists on the Blockchain, and not in any wallets.</em></strong> In the school analogy above, Bitcoin is the provision that is <strong><em>permanently</em></strong> located in the cafeteria <em>(blockchain).</em> Still, you can only lay claim to a portion of that provision and have the right to transfer its ownership with the keys in the lockers <em>(Wallets).</em>\n\n<em>TAKEAWAY:</em>\n\n- <strong><em>A Bitcoin wallet is a software that stores many key pairs of \"Public and Private Keys\" - e.g, Valet</em></strong>\n- <strong><em>All bitcoins exist only on the Bitcoin blockchain and not in the Bitcoin wallet.</em></strong>\n\n\n<strong>PRIVATE AND PUBLIC KEYS - How the magic works:</strong>\n\nNow, let us get into the lockers and see what these keys are. In the locker, there are so many keys, and all of them are in pairs - <strong><em>a Private key and a Public Key make one key pair.</em></strong>\n\nWhen a friend wants to give you a portion of their provision <em>(a Bitcoin payment)</em>, or your school wants to reward you with some provisions for winning the national mathematics competition <em>(Bitcoin mining)</em>, you will get a Public key from one of the key pairs in you locker <em>(wallet)</em> and share it with your friend or the school director. They'll assign a portion of the provision to your public key <em>(Remember, this provision always stays in the cafeteria).</em>\n\nThe only difference now is that whatever portion your friend gave you or the school director rewarded you with is now assigned to your public key, hence your Bitcoins.\nYou can always share your public key <em>(in the form of a <strong>Bitcoin address</strong> - explained below)</em> with anyone to receive Bitcoins <em>(assign ownership of a portion of Bitcoin stored on the blockchain to you)</em>. You can see the amount of Bitcoin you own in your wallet - developers designed it to provide a good user experience.\n\nNow, suppose you want to assign some of your provisions <em>(bitcoin)</em> to another friend. In that case, you will need to sign it with the other key pair so that everyone in the school will know that you have transferred ownership of some of your provisions to your friend. <strong><em>This is the function of the private key.</em></strong>\n\n<strong><em>The private key is used to sign Bitcoin transactions before they can be recognised and approved by the Bitcoin network</em></strong> <em>(a topic for another day).</em>\nIt is private because if anyone gets this key, they can use it to move/assign all your provisions <em>(Bitcoins)</em> to any public key they like in their locker <em>(wallet)</em>, and hence you'll lose all your provisions <em>(Bitcoins)</em>.\n\nIt is important to note that you can own as many lockers <em>(wallets)</em> as possible and hence as many key pairs as possible. Remember, <strong><em>each locker contains multiple key pairs, and you can even create more key pairs in a locker if you desire.</em></strong>\n\nSo again, for every key pair, there's a public key and a unique private key. If you have, say, 10 key pairs in your locker, the private key <em>\"1\"</em> can only lock and unlock provisions <em>(bitcoins)</em> assigned to the public key <em>\"1\"</em>, and so on.\n\n<em>TAKEAWAY:</em>\n\n- <strong><em>Every public key has a unique private key that can lock and unlock all Bitcoins assigned to it.</em></strong>\n- <strong><em>You own a Bitcoin amount because that amount of Bitcoin on the blockchain is assigned to a public key in your wallet, which you also hold the equivalent private key with which you can spend it.</em></strong>\n- <strong><em>You can only see the total amount of Bitcoins you own {assigned to your public key(s)} in your Bitcoin wallet.</em></strong>\n\n\n<strong>BITCOIN ADDRESS:</strong>\n\nThink of Bitcoin addresses as a card generated from your public key, where someone can write the exact quantity of the provision assigned to that public key. You can write on that card as many times as you want. Still, you can choose to generate new cards <em>(bitcoin addresses)</em> from another public key in your locker, each time you wish to receive provisions.\n\nSo, your friend wants to assign a portion of their provision allowance in the cafeteria to you. You will:\n\n- <em>Go to your locker (wallet)</em>\n\n- <em>Pick a key pair from the locker</em>\n\n- <em>Generate a paper card (Bitcoin address) from the public key of the key pairs you picked, and give that card to your friend.</em>\n\n- <em>They'll now write the quantity of provisions (Bitcoin) they have assigned to you on the card and sign it with their private key.</em>\n\n- <em>It gets recorded in the cafeteria (Blockchain), and everyone can see that the card (wallet address belonging to your public key) now owns this amount of Bitcoin.</em>\n\nIn other words, when someone wants to send Bitcoins to you, you will generate a Bitcoin address from your public key and send the address to them. They will send Bitcoins to that address and sign it with their private key before the Bitcoin network recognizes it as valid and records it on the blockchain.\n\nYou may choose to use one Bitcoin address to receive Bitcoins multiple times, or you can always generate new addresses from the numerous key pairs in your wallet.\n\n<strong><em>This is why a Bitcoin wallet (e.g, Valet) is essential, because Bitcoin wallets (the lockers) are always designed to automatically manage all these functions for you, including address generation and transaction signing. So you don't have to do these things manually.</em></strong>\n\n<em>TAKEAWAY:</em>\n\n- <strong><em>A Bitcoin address is generated from your public key.</em></strong>\n- <strong><em>You receive Bitcoin on a Bitcoin address.</em></strong>\n- <strong><em>The term \"sending Bitcoin\" means \"moving the right of ownership of a particular Bitcoin on the blockchain to another person, while \"receiving Bitcoin\" means \"gaining the right of ownership of a Bitcoin on the blockchain from another person.</em></strong>\n- <strong><em>Your wallet controls all these functions, so you don't have to break your head to generate all these keys. You don't even need to know what private key is associated with any public key in your wallet, because your wallet automatically identifies each private/public key pair and signs your transactions with the appropriate private key when needed.</em></strong>\n\n\n<strong>THE 12/24 SEED PHRASE:</strong>\n\nWe cannot conclude this article without discussing the popular <strong><em>12/24 seed phrase.</em></strong> I'm pretty sure that you already have an idea about what it is, as virtually every Bitcoin wallet app out there uses it.\n\nSo, if we only needed your private key to sign your Bitcoin transactions, why do we need the popular 12-word seed phrase, especially when experts keep saying you should secure it as if your life depends on it? <em>(Your Bitcoin financial life actually does depend on it 😜)</em>\n\nNow, back to our locker analogy. The 12/24 words seed phrase <em>(technically known as a mnemonic seed phrase)</em> is the key to your locker.\n\nLet us explain it. Your locker contains numerous pairs of private/public keys to which Bitcoin is assigned and can be spent <em>(i.e., transfer of ownership).</em> If you did not have a locker, you would have had to always face the herculean task of managing hundreds or even thousands of key pairs, making sure that you do not misplace the keys with each other, and making sure that each time you want to give someone a provision <em>(Bitcoin)</em>, that you used the corresponding private key to which the right of ownership of your provisions is assigned.\n\nHowever, your locker was designed to automatically and accurately manage all these key pairs for you, generate addresses as needed, and perform many other tasks that we cannot cover in this article. Therefore, it is only reasonable that we have a way to protect and prevent unauthorized access to your locker <em>(wallet)</em>. <strong><em>This is what the 12/24 words seed phrase does.</em></strong>\n\nWhen you download a Bitcoin wallet application like <strong><em><a href=\"#\">Valet</a></em></strong> and set up your wallet, the wallet also automatically generates a 12-word key for you, which you can use to restore your wallet at any time.\n\nHere's how to think about it - when you change dormitory or class, all you need to do in your new dormitory or class is to go to any locker, enter your locker key <em>(12/24 seed phrase)</em>, and all your public/private key pairs will be imported into that locker, and you can see all the provisions assigned to your keys.\n\nSo, if anyone knows your 12 phrase seeds, they can go to any of the lockers in the school and enter your key. They can quickly assign your provisions to anybody they want or to themselves. Since there are no names attached to these lockers or even the keys, it means that there is no way to trace who owns which locker, public key, or whatever.\n\nSomeone can only know that you own a particular public key if you tell them that you do. However, anyone in the school can always view the records of provisions that have been assigned and reassigned from one address to another in the Cafeteria <em>(Bitcoin Blockchain).</em> This is why it is advisable to generate a new address <em>(card)</em> each time you want to make a new Bitcoin transaction, as this helps keep your privacy intact.\n\nIt is essential to know that you can import a single pair of private/public keys to a Bitcoin wallet and spend the Bitcoin associated with that particular key pair. This means you can go to your locker, take out one pair of public/private keys, and import only that key pair into another locker <em>(without needing your 12/24 seed phrase)</em> and spend Bitcoins associated with just that particular key pair. This is possible with several Bitcoin wallets, like <strong><em><a href=\"#\">Valet</a></em></strong>. This highlights the significance of private/public key pairs, as well as the immense scope of Bitcoin technology.\n\n<em>TAKEAWAY:</em>\n\n- <strong><em>Your 12/24 seed phrase is the ultimate key to your Bitcoin wallet. Anybody who gets access to it can spend all their Bitcoins.</em></strong>\n- <strong><em>A single pair of Public/Private keys can be imported into another Bitcoin wallet to spend the Bitcoins associated with just that key pair. This means that with your 12/24 seed phrase, you gain access to all the key pairs associated with a particular wallet. Meanwhile, Bitcoins associated with each public/private key pair can still be imported into another wallet and spent independently.</em></strong>\n\n\n<strong>CONCLUSION:</strong>\n\nThe concept of a Bitcoin wallet is broad. In this article, I have attempted to explain the basic components and processes of a Bitcoin wallet using a closely relatable real-life scenario - <strong>The School locker.</strong>\n\nSince the launch of Bitcoin in 2009 by <em>Satoshi Nakamoto</em>, the Bitcoin technology has evolved significantly in all aspects, including the wallet aspect.\n\n<strong><em><a href=\"#\">Valet</a></em></strong> is a robust Bitcoin wallet app that encompasses all the features of a modern Self-Custodial Bitcoin wallet, along with additional features that are not available on other wallets. Valet was designed to work in areas with limited internet access and is compatible with any Android device, including those running old Android versions as far back as Android version 8.\n\nClick <em><a href=\"#\">here</a></em> to watch a video on how to install <strong><em><a href=\"#\">Valet</a></em></strong> and experience Bitcoin storage differently.\n\nIf you love this article, please like, share, and subscribe to receive updates whenever a new article like this one is published.\n\n\nShutting Down....\n\n\n",
      "category": "Education",
      "date": "2025-07-22",
      "readTime": "9 min read",
      "featured": true,
      "image": "images/Locker.jpg",
      "slug": "school-locker-bitcoin-wallet",
      "author": {
  "name": "Ugochukwu Chidire David",
  "title": "Product Growth Lead at Standard Sats",
        "bio": "Product Growth Lead at Standard Sats.",
        "avatar": "images/author-avatar.jpg",
        "social": {
          "twitter": "@orion_davids",
          "linkedin": "Chidire-David-Ugochukwu",
          "github": "0orion"
        }
      }
    },
    {
      "id": "1",
      "title": "The Future of Lightning Network in 2025",
      "excerpt": "Exploring upcoming developments and innovations in Bitcoin's <strong>Lightning Network</strong> that will revolutionize <em>micro-payments</em> and financial inclusion worldwide! ⚡",
      "content": "Full article content will go here...",
      "category": "Technology",
      "date": "2025-01-15",
      "readTime": "5 min read",
      "featured": false,
      "image": "images/Locker.jpg",
      "slug": "lightning-network-future-2025",
      "author": {
        "name": "Ugochukwu Chidire David",
        "bio": "Product Growth Lead at Standard Sats.",
        "avatar": "images/author-avatar.jpg",
        "social": {
          "twitter": "@orion_davids",
          "linkedin": "ugochukwu-chidire-david",
          "github": "0orion"
        }
      }
    }
      ,
      {
        "id": "holding-bitcoin-back-moe-situation",
        "title": "HOLDING BITCOIN BACK - The MoE Situation 🤝💰🤝",
        "excerpt": "Bitcoin adoption as a medium of exchange is slow. The two biggest reasons: not enough people own Bitcoin, and merchants fear price volatility.",
        "content": "<h2>GLOBAL BITCOIN ADOPTION AS A MEDIUM OF EXCHANGE IS SLOW AND HERE'S WHY!!</h2><br><br><br><p>TL; DR: Bitcoin adoption as a medium of exchange is slow, and the two most significant reasons why this is so are that <b><i>“Not enough people own Bitcoins”</i></b>, and <b><i>“Merchants are afraid to accept Bitcoin due to Bitcoin's Price Volatility\"</i></b> <i>(a compulsory rough path to hyperbitcoinization)”</i>.</p><br><br><br><i>Booting....<i/><br><br><br><p>Again, as you probably already know, for Bitcoin to fully become money, it needs to satisfy three basic roles of:<br><br><ul>\n <li><i>Medium of Storage of Value</i></li>\n<li><i>Medium of Exchange<i/></li>\n<li><i>Unit Of Accounting</i></li>\n</ul><br><br>And so far, by the virtue of Bitcoin's inherent progressive scarcity, it is a deflationary asset, which means that the value of Bitcoin will, in an unrythmical manner, increase over time because of the basic principle of supply and demand, which makes it a great Medium of Storage of Value.<br>However, jumping the line to the third role, we realize that Bitcoin would need to reach a peak global adoption where the majority of the world agrees and recognizes its value and importance, before it can be used as a unit of accounting.<br><br>Each of these monetary roles, when fulfilled, by default, should usher in the next one smoothly, but somehow it seems we are stuck on the second role, and we don't seem to be making significant progress. For Bitcoin to be regarded as a medium of exchange, a reasonable number of the global population should be willing to accept it in exchange for value, especially businesses and service providers.<br><br>A lot of people may attribute the slow adoption of Bitcoin as a Medium of Exchange solely to the issue of <b><i>\"uncertainty in government regulation\"</i></b>. As much as this is an important factor, I think this is the least important factor. I assume it is the least of the impending factors because governments will eventually draft regulations as they deem fit when they realize that people are demanding Bitcoin for payments. One of the basic natures of sound money is that it embodies a free market situation where people can choose to use it or not.<br><br>Aside from in tyrannical and authoritarian regimes where Bitcoin may be outrightly banned and outlawed, Bitcoin does not necessarily need to be recognized as a legal tender before anyone can choose to accept it as a means of payment for their products and services. A typical example is in El Salvador, where the legal tender status of Bitcoin has been withdrawn, but people are still willing to accept it for payment.<br><br>So, I do think that the two main reasons for this slow and low adoption of Bitcoin as a Means of Exchange are:<br><br><ul>\n <li><i>Low Number Of Average People Who Own Bitcoin</i></li>\n<li><i>Bitcoin's Price Volatility</i></li></p><br><br><br><p><b>LOW NUMBER OF AVERAGE BITCOIN OWNERS (Willing to spend)</b><br><br><br>This idea suggests that perhaps Bitcoin has not fully and universally satisfied its first role as a medium of storing value before it moved on to try to become a medium of exchange. Reports from several data sources, including one from <a href=\"https://www.chainalysis.com/blog/bitcoin-addresses/\">Chainalysis</a>, suggest that out of the <b><i>460 million</i></b> Bitcoin addresses that exist, only about <b><i>172 million</i></b> addresses are economically viable <i>(hold some Bitcoins in them)</i>, with over <b><i>89%</i></b> of these addresses identified to belong to different forms of Crypto services. This leaves way below <b><i>30 million</i></b> Bitcoin addresses belonging to individuals.<br>While over <b><i>70%</i></b> of the world's population has access to <a href=\"https://www.worldbank.org/en/publication/globalfindex\">banking services</a>, only a tiny fraction of this number, compared to the number of banked humans, actually own Bitcoin, and a good percentage of these Bitcoin owners are <b><i>HODLers</i></b>, which are mostly early birds and High Net worth Individuals, Treasury Institutions, governments, etc.<br><br>For Bitcoin to become a global means of exchange, a reasonable percentage of average individuals in society would need to own Bitcoin. Because it is from owning Bitcoin that one might begin to think about exchanging their Bitcoins for other value.</p><br><br><br><p><b>BITCOIN'S PRICE VOLATILITY:</b><br><br>Of all the factors slowing Bitcoin down from becoming a go-to global means of exchange, <b><i>\"Bitcoin's volatile price action\"</i></b> is arguably the most crucial one. There are a lot of Bitcoin owners who might be willing to spend their Bitcoins for other values, but the uncertain price movement of Bitcoin, which can be incredibly volatile, creates a lingering fear of the unknown in the minds of people.<br><br>Verifiable data from <a href=\"https://btcmap.org/map#0/-45.58329/-184.21875\">BTCmap.org</a> suggests that at least <b><i>18,000</i></b> businesses accept Bitcoin across the globe. This number represents just a tiny fraction of the millions of businesses and commercial services scattered all over the world.<br>So the real question is: <b>why is Bitcoin's adoption as a medium of exchange low and slow despite what seems like a parabolic increase in Bitcoin awareness over the past few years? Why aren't people and businesses eager to accept payments in Bitcoin, especially since it is valuable and appreciates over time?<b><br><br>Let's face the hard reality: the world has been indoctrinated with the illusion of a stable Fiat currency <i>(albeit it stealthily loses value over time)</i> for decades, and human nature is inclined towards always seeking out the safer option.<br>So, as much as Bitcoin is evidently valuable over time, the uncertainty of Bitcoin's price movement poses a huge challenge to businesses and service providers who might want to accept it as a means of exchange, especially for the fact that these businesses run on the Fiat system and need to be financially operational at all times.<br>This then means that even if Bitcoin owners are willing to pay with Bitcoin, businesses and services may not yet be readily willing to accept it because of obvious reasons.</p><br><br><br><p><b>WAY TO GO<b><br><br>To solve the first issue, as Bitcoin builders, we should gear towards building solutions that make it easy and relatively less costly for people to get and own Bitcoin. Thanks to the Lightning network for providing a starting point. There have been other great solutions like Robosats, Bisq, etc, where users can buy Bitcoins for fiat through the lightning network; however, these solutions seem uniquely made for plebs and maxis.<br>The bottom line is that we should build solutions that bridge the gap and open doors for anyone with no technical knowledge or even a proper understanding of Bitcoin to be able to own Bitcoin, just because they want to own it. And, no, I'm not talking about centralized exchanges and their IOU Bitcoins.<br><br>Secondly, it is important to emphasize that every monetary asset that has gone on to become a global means of exchange was able to replace the old means of exchange by first mimicking it, either directly or indirectly. The majority of the world is still obsessed with the Fiat stable illusion, and it is still largely the best way for businesses to run and stay afloat, because they know <i>(theoretically)</i> that a $50 bill received for a product remains $50 bill for as long as they want to keep it.<br><br>So the best way to rapidly increase Bitcoin acceptance in stores, hence increasing Bitcoin's function as a medium of exchange, is to mimic the Fiat monetary asset directly on Bitcoin. Fortunately, a lot of solutions like Fedimint, Cashu, etc, are promising, but they entirely create a different network on their own, which requires users to begin to learn and understand how these work. Another cumbersome task, if you ask me.<br>Thankfully, there are emerging technologies like the \"Hosted/Fiat channels\" that offer a unique Bitcoin-backed Fiat derivatives right on the Bitcoin Lightning Network.</p><br><br><br><p><b>SUMMARY:<b><br><br><br>We have identified that for Bitcoin to grow as a means of exchange of value, there must be more people who own Bitcoin, especially average individuals who would readily spend it for their day-to-day living.<br>But most importantly, for Bitcoin owners to be able to spend Bitcoin, there must be people willing to accept Bitcoin for their products or services, and they should be able to do this without having the Bitcoin price fluctuations affect their business's financial operation.<br><br>In the next article, we'll dive deep into exploring the different solutions and technologies that are trying to solve these problems and how we may begin to position them, especially ensuring that they maintain Bitcoin’s core ethos.<br><br><br>Keep Stacking Sats!!</p><br><br><br><b><i>Shutting down....</i></b>",
        "category": "Education",
        "date": "2025-09-25",
        "readTime": "7 minutes",
        "featured": false,
    "image": "images/exchange.jpg",
        "slug": "holding-bitcoin-back-moe-situation",
        "author": {
          "name": "Ugochukwu Chidire David",
          "bio": "Product and community growth lead for Standard Sats",
          "avatar": "",
          "social": {
            "twitter": "@orion_davids",
            "linkedin": "https://www.linkedin.com/in/chidire-ugochukwu-3aab8b276?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_contact_details%3BsqwwdGFmQ3OImK77WjKXcA%3D%3D",
            "github": "0orion"
          }
        }
      }
    ]
}